In [1]:
import pandas as pd

In [11]:
df = pd.read_csv("https://raw.githubusercontent.com/manishanker/Statistics_ML_26Aug/master/doubts/orange_dataset.csv")

In [18]:
df.describe()

       Unnamed: 0      Tree          age  circumference
count   35.000000  35.00000    35.000000      35.000000
mean    18.000000   3.00000   922.142857     115.857143
std     10.246951   1.43486   491.864528      57.488179
min      1.000000   1.00000   118.000000      30.000000
25%      9.500000   2.00000   484.000000      65.500000
50%     18.000000   3.00000  1004.000000     115.000000
75%     26.500000   4.00000  1372.000000     161.500000
max     35.000000   5.00000  1582.000000     214.000000

In [14]:
df.isna().sum()

Unnamed: 0       0
Tree             0
age              0
circumference    0
dtype: int64

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35 entries, 0 to 34
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Unnamed: 0     35 non-null     int64
 1   Tree           35 non-null     int64
 2   age            35 non-null     int64
 3   circumference  35 non-null     int64
dtypes: int64(4)
memory usage: 1.2 KB

In [16]:
df.shape

(35, 4)

 - ## Run describe command to get the descriptive statistics on bank.csv
 - ## Shape of the bank.csv dataset
 - ## Are there any null values in bank.csv dataset?
 - ## Print first 5 rows

In [33]:
# bank_csv --> 
# https://raw.githubusercontent.com/manishanker/statistics_ML_jan_2020/master/bank.csv

In [59]:
df1 = pd.read_csv("https://raw.githubusercontent.com/manishanker/statistics_ML_jan_2020/master/bank.csv", 
                  delimiter=";")

In [37]:
df1.describe()

,age,day,duration,campaign,pdays,previous
count,4521.000000,4520.000000,4519.000000,4521.000000,4521.000000,4521.000000
mean,41.170095,15.915487,263.984952,2.793630,39.766645,0.542579
std,10.576211,8.248569,259.896301,3.109807,100.121124,1.693562
min,19.000000,1.000000,4.000000,1.000000,-1.000000,0.000000
25%,33.000000,9.000000,104.000000,1.000000,-1.000000,0.000000
50%,39.000000,16.000000,185.000000,2.000000,-1.000000,0.000000
75%,49.000000,21.000000,329.000000,3.000000,-1.000000,0.000000
max,87.000000,31.000000,3025.000000,50.000000,871.000000,25.000000

In [41]:
df1.isna().sum()

age          0
job          3
marital      3
education    3
default      0
balance      1
housing      1
loan         0
contact      3
day          1
month        0
duration     2
campaign     0
pdays        0
previous     0
poutcome     0
y            3
dtype: int64

In [48]:
df1.shape

(4521, 1)

In [54]:
df1.head()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,30,unemployed,married,primary,no,1787,no,no,cellular,19.0,oct,79.0,1,-1,0,unknown,no
1,33,services,married,secondary,no,4789,yes,yes,cellular,11.0,may,220.0,1,339,4,failure,no
2,35,management,single,tertiary,no,1350,yes,no,cellular,16.0,apr,185.0,1,330,1,failure,no
3,30,management,married,tertiary,no,1476,yes,yes,unknown,3.0,jun,199.0,4,-1,0,unknown,no
4,59,blue-collar,married,secondary,no,0,yes,no,unknown,5.0,may,226.0,1,-1,0,unknown,no

In [55]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4521 entries, 0 to 4520
Data columns (total 17 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   age        4521 non-null   int64
 1   job        4518 non-null   object
 2   marital    4518 non-null   object
 3   education  4518 non-null   object
 4   default    4521 non-null   object
 5   balance    4520 non-null   object
 6   housing    4520 non-null   object
 7   loan       4521 non-null   object
 8   contact    4518 non-null   object
 9   day        4520 non-null   float64
 10  month      4521 non-null   object
 11  duration   4519 non-null   float64
 12  campaign   4521 non-null   int64
 13  pdays      4521 non-null   int64
 14  previous   4521 non-null   int64
 15  poutcome   4521 non-null   object
 16  y          4518 non-null   object
dtypes: float64(2), int64(4), object(11)
memory usage: 600.6+ KB

In [58]:
df1["job"].value_counts()

management       968
blue-collar      946
technician       767
admin.           478
services         417
retired          230
self-employed    183
entrepreneur     167
unemployed       128
housemaid        112
student           84
unknown           38
Name: job, dtype: int64